saffetblt/ARM-STM32F4-ECLIPSE/STM32F4-DOCUMENT/.cache/NXP.MK22F12_DFP.10.0.1.pdsc
    <condition id="device.MK22F12_driver.common">
      <accept Dvendor="NXP:11" Dname="MK22FN1M0???12"/>
      <accept Dvendor="NXP:11" Dname="MK22FX512???12"/>
      <require Cclass="CMSIS" Cgroup="CORE" Cversion="5.0.1"/>
      <require Cclass="Device" Cgroup="Startup"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="clock"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
    </condition>
    <condition id="device.MK22F12_driver.flash">
      <accept Dvendor="NXP:11" Dname="MK22FN1M0???12"/>
      <accept Dvendor="NXP:11" Dname="MK22FX512???12"/>
      <require Cclass="CMSIS" Cgroup="CORE" Cversion="5.0.1"/>
      <require Cclass="Device" Cgroup="Startup"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="flash"/>
    </condition>
    <condition id="device.MK22F12">
      <accept Dvendor="NXP:11" Dname="MK22FN1M0???12"/>
      <accept Dvendor="NXP:11" Dname="MK22FX512???12"/>
      <require Cclass="CMSIS" Cgroup="CORE" Cversion="5.0.1"/>
      <require Cclass="Device" Cgroup="Startup"/>
    </condition>
    <condition id="devices.MK22F12_platform.Include_core_cm4">
      <accept Dvendor="NXP:11" Dname="MK22FN1M0???12"/>
      <accept Dvendor="NXP:11" Dname="MK22FX512???12"/>
      <require Cclass="CMSIS" Cgroup="CORE" Cversion="5.0.1"/>
    </condition>
    <condition id="devices.MK22FN1M0xxx12_mdk">
      <require Tcompiler="ARMCC"/>
      <accept Dvendor="NXP:11" Dname="MK22FN1M0???12"/>
    </condition>
    <condition id="devices.MK22FX512xxx12_mdk">
      <require Tcompiler="ARMCC"/>
      <accept Dvendor="NXP:11" Dname="MK22FX512???12"/>
    </condition>
    <condition id="devices.MK22FN1M0xxx12_iar">
      <require Tcompiler="IAR"/>
      <accept Dvendor="NXP:11" Dname="MK22FN1M0???12"/>
    </condition>
    <condition id="devices.MK22FX512xxx12_iar">
      <require Tcompiler="IAR"/>
      <accept Dvendor="NXP:11" Dname="MK22FX512???12"/>
    </condition>
    <condition id="mdk">
      <require Tcompiler="ARMCC"/>
    </condition>
    <condition id="iar">
      <require Tcompiler="IAR"/>
    </condition>
  </conditions>
  <components>
    <component Cclass="Device" Cgroup="Startup" Cversion="1.0.0" condition="devices.MK22F12_platform.Include_core_cm4">
      <description></description>
      <files>
        <file name="arm/startup_MK22F12.s" category="sourceAsm" condition="mdk" attr="config"/>
        <file name="iar/startup_MK22F12.s" category="sourceAsm" condition="iar" attr="config"/>
        <file name="MK22F12.h" category="header" attr="config"/>
        <file name="MK22F12_features.h" category="header" attr="config"/>
        <file name="fsl_device_registers.h" category="header" attr="config"/>
        <file name="arm/MK22FN1M0xxx12_flash.scf" category="linkerScript" condition="devices.MK22FN1M0xxx12_mdk" attr="config"/>
        <file name="arm/MK22FN1M0xxx12_ram.scf" category="linkerScript" condition="devices.MK22FN1M0xxx12_mdk" attr="config"/>
        <file name="arm/MK22FX512xxx12_flash.scf" category="linkerScript" condition="devices.MK22FX512xxx12_mdk" attr="config"/>
        <file name="arm/MK22FX512xxx12_ram.scf" category="linkerScript" condition="devices.MK22FX512xxx12_mdk" attr="config"/>
        <file name="iar/MK22FN1M0xxx12_flash.icf" category="linkerScript" condition="devices.MK22FN1M0xxx12_iar" attr="config"/>
        <file name="iar/MK22FN1M0xxx12_ram.icf" category="linkerScript" condition="devices.MK22FN1M0xxx12_iar" attr="config"/>
        <file name="iar/MK22FX512xxx12_flash.icf" category="linkerScript" condition="devices.MK22FX512xxx12_iar" attr="config"/>
        <file name="iar/MK22FX512xxx12_ram.icf" category="linkerScript" condition="devices.MK22FX512xxx12_iar" attr="config"/>
        <file name="system_MK22F12.c" category="sourceC" attr="config"/>
        <file name="system_MK22F12.h" category="header" attr="config"/>
      </files>
    </component>
    <component Cclass="Board Support" Cgroup="SDK Project Template" Cversion="1.0.0" Csub="project_template" Cvariant="MK22F12" isDefaultVariant="1" condition="devices.MK22F12_device.MK22F12_device.MK22F12_startup_device.device_device_driver.clock_driver.common_driver.gpio_driver.port_driver.smc_driver.uart_utility.debug_console">
      <description></description>
      <files>
        <file name="project_template/board.c" category="sourceC" attr="config"/>
        <file name="project_template/board.h" category="header" attr="config"/>
        <file name="project_template/clock_config.c" category="sourceC" attr="config"/>
        <file name="project_template/clock_config.h" category="header" attr="config"/>
        <file name="project_template/peripherals.c" category="sourceC" attr="config"/>
        <file name="project_template/peripherals.h" category="header" attr="config"/>
        <file name="project_template/pin_mux.c" category="sourceC" attr="config"/>
        <file name="project_template/pin_mux.h" category="header" attr="config"/>
      </files>
    </component>
    <component Cclass="CMSIS Driver" Cgroup="SPI" Cversion="2.0.0" Csub="dspi_cmsis" condition="RTE_Device_platform.CMSIS_Driver_Include.SPI_CMSISInclude_device.MK22F12_driver.dspi">
      <description>DSPI CMSIS Driver</description>
      <files>
        <file name="cmsis_drivers/fsl_dspi_cmsis.c" category="sourceC"/>
        <file name="cmsis_drivers/fsl_dspi_cmsis.h" category="header"/>
      </files>
    </component>
    <component Cclass="CMSIS Driver" Cgroup="I2C" Cversion="2.0.1" Csub="i2c_cmsis" condition="RTE_Device_platform.CMSIS_Driver_Include.I2C_CMSISInclude_device.MK22F12_driver.i2c">
      <description>I2C CMSIS Driver</description>
      <files>
        <file name="cmsis_drivers/fsl_i2c_cmsis.c" category="sourceC"/>
        <file name="cmsis_drivers/fsl_i2c_cmsis.h" category="header"/>
      </files>
    </component>
    <component Cclass="CMSIS Driver" Cgroup="USART" Cversion="2.0.0" Csub="uart_cmsis" condition="RTE_Device_platform.CMSIS_Driver_Include.USART_CMSISInclude_device.MK22F12_driver.uart">
      <description>UART CMSIS Driver</description>
      <files>
        <file name="cmsis_drivers/fsl_uart_cmsis.c" category="sourceC"/>
        <file name="cmsis_drivers/fsl_uart_cmsis.h" category="header"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Cversion="2.0.0" Csub="adc" condition="device.MK22F12_driver.common">
      <description>ADC16 Driver</description>
      <files>
        <file name="drivers/fsl_adc16.c" category="sourceC"/>
        <file name="drivers/fsl_adc16.h" category="header"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Cversion="2.1.0" Csub="clock" condition="device.MK22F12_driver.common">
      <description>Clock Driver</description>
      <files>
        <file name="drivers/fsl_clock.c" category="sourceC"/>
        <file name="drivers/fsl_clock.h" category="header"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Cversion="2.0.0" Csub="cmp" condition="device.MK22F12_driver.common">
      <description>CMP Driver</description>
      <files>
        <file name="drivers/fsl_cmp.c" category="sourceC"/>
        <file name="drivers/fsl_cmp.h" category="header"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Cversion="2.0.1" Csub="cmt" condition="device.MK22F12_driver.common">
      <description>CMT Driver</description>
      <files>
        <file name="drivers/fsl_cmt.c" category="sourceC"/>
        <file name="drivers/fsl_cmt.h" category="header"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Cversion="2.0.0" Csub="common" condition="device.MK22F12_driver.common">
      <description>COMMON Driver</description>
      <files>
        <file name="drivers/fsl_common.c" category="sourceC"/>
        <file name="drivers/fsl_common.h" category="header"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Cversion="2.0.1" Csub="crc" condition="device.MK22F12_driver.common">
      <description>CRC Driver</description>
      <files>
        <file name="drivers/fsl_crc.c" category="sourceC"/>
        <file name="drivers/fsl_crc.h" category="header"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Cversion="2.0.1" Csub="dac" condition="device.MK22F12_driver.common">
      <description>DAC Driver</description>
      <files>
        <file name="drivers/fsl_dac.c" category="sourceC"/>
        <file name="drivers/fsl_dac.h" category="header"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Cversion="2.0.2" Csub="dmamux" condition="device.MK22F12_driver.common">
      <description>DMAMUX Driver</description>
      <files>
        <file name="drivers/fsl_dmamux.c" category="sourceC"/>
        <file name="drivers/fsl_dmamux.h" category="header"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Cversion="2.2.0" Csub="dspi" condition="device.MK22F12_driver.common">
      <description>DSPI Driver</description>
      <files>
        <file name="drivers/fsl_dspi.c" category="sourceC"/>
        <file name="drivers/fsl_dspi.h" category="header"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Cversion="2.2.0" Csub="dspi_edma" condition="device.MK22F12_driver.dspi_driver.edma">
      <description>DSPI Driver</description>
      <files>
        <file name="drivers/fsl_dspi_edma.c" category="sourceC"/>
        <file name="drivers/fsl_dspi_edma.h" category="header"/>
      </files>
    </component>
